tap "apple/apple", "http://github.com/apple/homebrew-apple"
tap "common-fate/granted"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jandedobbeleer/oh-my-posh"
tap "teamookla/speedtest"
brew "automake"
brew "readline"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "bat"
brew "bison"
brew "glib"
brew "chezmoi"
brew "cmake"
brew "libyaml"
brew "ruby"
brew "cocoapods"
brew "coreutils"
brew "csvkit"
brew "harfbuzz"
brew "icu4c@76"
brew "epubcheck"
brew "fd"
brew "gnutls"
brew "librist"
brew "pango"
brew "ffmpeg"
brew "openssl@1.1"
brew "fontforge"
brew "fzf"
brew "gdbm"
brew "gh"
brew "git"
brew "git-delta"
brew "gnu-sed"
brew "gnupg"
brew "pkgconf"
brew "gobject-introspection"
brew "gpgme"
brew "grep"
brew "libheif"
brew "imagemagick"
brew "jq"
brew "libffi"
brew "llvm@16"
brew "neofetch"
brew "neovim"
brew "pandoc"
brew "pinentry-mac"
brew "poppler"
brew "python@3.9"
brew "qt"
brew "rename"
brew "ripgrep"
brew "the_silver_searcher"
brew "tmux"
brew "ttfautohint"
brew "uv"
brew "vim"
brew "wget"
brew "ykman"
brew "ykpers"
brew "common-fate/granted/granted"
brew "jandedobbeleer/oh-my-posh/oh-my-posh", link: false
brew "teamookla/speedtest/speedtest"
cask "anki"
cask "artisan"
cask "betterdisplay"
cask "calibre"
cask "discord"
cask "docker-desktop"
cask "google-chrome"
cask "grandperspective"
cask "imageoptim"
cask "iterm2"
cask "maccy"
cask "mactex"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "nextcloud"
cask "obsidian"
cask "rectangle"
cask "runelite"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "vlc"
cask "wezterm"
cask "xld"
cask "zoom"
